app/controllers/trello_cards_controller.rb

  def index
    @trello_cards = TrelloCard.all.filter( params.permit( :environment, :priority , :message_type , :time_period) )
---
SELECT "trello_cards".* FROM "trello_cards" WHERE "trello_cards"."environment" = ? AND "trello_cards"."priority" = ? AND "trello_cards"."message_type" = ?  [["environment", 3], ["priority", 3], ["message_type", 3]]

  def create

    respond_to do |format|
          @trello_card = TrelloCard.new(trello_card_params)

          if @trello_card.save
---
INSERT INTO "trello_cards" ("name", "description", "created_at", "updated_at", "priority", "environment", "username", "hostname", "message_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)